In [7]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
from numpy import nan as NA

string_data = pd.Series(['aardvark','artichoke', np.nan, 'avocado'])
string_data

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [6]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all') # only drops rows that are all NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.dropna(how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.250065 -0.754266 -1.606387
1 -0.487792  1.193411 -0.952990
2 -1.435149 -0.223626 -0.814177
3  0.685750  0.497388 -1.188719
4  1.090148 -0.334075  1.461746
5  0.805631  1.151476 -1.268581
6 -2.300863  0.613228 -0.780140

In [23]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.250065       NaN       NaN
1 -0.487792       NaN       NaN
2 -1.435149       NaN -0.814177
3  0.685750       NaN -1.188719
4  1.090148 -0.334075  1.461746
5  0.805631  1.151476 -1.268581
6 -2.300863  0.613228 -0.780140

In [24]:
df.dropna()

          0         1         2
4  1.090148 -0.334075  1.461746
5  0.805631  1.151476 -1.268581
6 -2.300863  0.613228 -0.780140

In [25]:
df.dropna(thresh=2) # only drop rows if at least 2  entries are NaN

          0         1         2
2 -1.435149       NaN -0.814177
3  0.685750       NaN -1.188719
4  1.090148 -0.334075  1.461746
5  0.805631  1.151476 -1.268581
6 -2.300863  0.613228 -0.780140

In [26]:
df.fillna(0)

          0         1         2
0  0.250065  0.000000  0.000000
1 -0.487792  0.000000  0.000000
2 -1.435149  0.000000 -0.814177
3  0.685750  0.000000 -1.188719
4  1.090148 -0.334075  1.461746
5  0.805631  1.151476 -1.268581
6 -2.300863  0.613228 -0.780140

In [28]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.250065  0.500000  0.000000
1 -0.487792  0.500000  0.000000
2 -1.435149  0.500000 -0.814177
3  0.685750  0.500000 -1.188719
4  1.090148 -0.334075  1.461746
5  0.805631  1.151476 -1.268581
6 -2.300863  0.613228 -0.780140

In [29]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.250065  0.000000  0.000000
1 -0.487792  0.000000  0.000000
2 -1.435149  0.000000 -0.814177
3  0.685750  0.000000 -1.188719
4  1.090148 -0.334075  1.461746
5  0.805631  1.151476 -1.268581
6 -2.300863  0.613228 -0.780140

In [30]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.395601  0.299898  0.795572
1  0.815394  1.210301  1.210382
2  1.496900       NaN  0.995405
3 -0.920048       NaN -0.877593
4 -0.884318       NaN       NaN
5 -0.672603       NaN       NaN

In [31]:
df.fillna(method='ffill')

          0         1         2
0  0.395601  0.299898  0.795572
1  0.815394  1.210301  1.210382
2  1.496900  1.210301  0.995405
3 -0.920048  1.210301 -0.877593
4 -0.884318  1.210301 -0.877593
5 -0.672603  1.210301 -0.877593

In [32]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.395601  0.299898  0.795572
1  0.815394  1.210301  1.210382
2  1.496900  1.210301  0.995405
3 -0.920048  1.210301 -0.877593
4 -0.884318       NaN -0.877593
5 -0.672603       NaN -0.877593

In [33]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [35]:
## Remove Duplicates
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [42]:
data = pd.DataFrame({'food': ['bacon','pulled pork','bacon','Pastrami','corned beef',
                             'Bacon','pastrami','honey ham','nova lox'],
                     'ounces': [4,3,12,6,7.5,8,3,6,5]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     6.0
8     nova lox     5.0

In [43]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled port': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [44]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [45]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     NaN
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     6.0     pig
8     nova lox     5.0  salmon

In [46]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

KeyError: 'pulled pork'